Repository: jrevillard/genie-ai-replica
Catalog: mobile/genie_ai_mobile_swiftui/GenieAI/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, pt, ru, sw, th, zh

source: Verification token is missing.
ar: رمز التحقق مفقود.
de: Verifizierungstoken fehlt.
es: Falta el token de verificación.
fr: Le jeton de vérification est manquant.
id: Token verifikasi hilang.
pt: O token de verificação está faltando.
ru: Токен проверки отсутствует.
sw: Tokeni ya uthibitishaji haipo.
th: ไม่พบโทเค็นการยืนยัน
zh: 验证令牌丢失。

source: Verifying your email...
ar: جاري التحقق من بريدك الإلكتروني...
de: Verifiziere deine E-Mail...
es: Verificando tu correo...
fr: Vérification de votre e-mail...
id: Memverifikasi email Anda...
pt: Verificando seu e-mail...
ru: Проверка вашего email...
sw: Inathibitisha barua pepe yako...
th: กำลังตรวจสอบอีเมลของคุณ...
zh: 正在验证您的电子邮件...

source: Version
ar: الإصدار
es: Versión
id: Versi
pt: Versão
ru: Версия
sw: Toleo
th: เวอร์ชัน
zh: 版本

source: Very Helpful
ar: مفيد جداً
de: Sehr hilfreich
es: Muy útil
fr: Très utile
id: Sangat Membantu
pt: Muito Útil
ru: Очень полезно
sw: Inasaidia Sana
th: มีประโยชน์มาก
zh: 很有帮助

source: Very Weak
ar: ضعيفة جداً
de: Sehr schwach
es: Muy débil
fr: Très faible
id: Sangat Lemah
pt: Muito Fraca
ru: Очень слабый
sw: Dhaifu Sana
th: อ่อนมาก
zh: 非常弱

source: Veterinary Medicine
ar: الطب البيطري
de: Veterinärmedizin
es: Medicina Veterinaria
fr: Médecine vétérinaire
id: Kedokteran Hewan
pt: Medicina Veterinária
ru: Ветеринария
sw: Tiba ya Mifugo
th: สัตวแพทยศาสตร์
zh: 兽医学

source: View Details
ar: عرض التفاصيل
de: Details anzeigen
es: Ver detalles
fr: Voir les détails
id: Lihat Detail
pt: Ver Detalhes
ru: Подробнее
sw: Angalia Maelezo
th: ดูรายละเอียด
zh: 查看详情

source: Vocational Certificate
ar: شهادة مهنية
es: Certificado Vocacional
fr: Certificat professionnel
id: Sertifikat Kejuruan
pt: Certificado Vocacional
ru: Профессиональный сертификат
sw: Cheti cha Ufundi
th: ใบรับรองวิชาชีพ
zh: 职业证书

source: Vocational Training
ar: التدريب المهني
de: Berufsausbildung
es: Formación Profesional
fr: Formation professionnelle
id: Pelatihan Kejuruan
pt: Formação Profissional
ru: Профессиональное обучение
sw: Mafunzo ya Ufundi
th: อาชีวศึกษา
zh: 职业培训

source: Voter ID
ar: رقم هوية الناخب
de: Wähler-ID
es: ID de votante
fr: ID d'électeur
id: ID Pemilih
pt: Título de eleitor
ru: ID избирателя
sw: Kitambulisho cha Mpiga Kura
th: เลขประจำตัวผู้มีสิทธิเลือกตั้ง
zh: 选民 ID

source: Voter registration details
ar: تفاصيل تسجيل الناخبين
de: Wählerregistrierungsdetails
es: Detalles de registro de votantes
fr: Détails d'inscription des électeurs
id: Detail pendaftaran pemilih
pt: Detalhes de registro de eleitor
ru: Детали регистрации избирателя
sw: Maelezo ya usajili wa wapiga kura
th: รายละเอียดการลงทะเบียนผู้มีสิทธิเลือกตั้ง
zh: 选民登记详情

source: Warning: This action is permanent and cannot be undone. All your data will be permanently deleted.
ar: تحذير: هذا الإجراء دائم ولا يمكن التراجع عنه. سيتم حذف جميع بياناتك نهائياً.
de: Warnung: Diese Aktion ist dauerhaft und kann nicht rückgängig gemacht werden. Alle deine Daten werden unwiderruflich gelöscht.
es: Advertencia: Esta acción es permanente. Todos tus datos se borrarán irremediablemente.
fr: Avertissement : Cette action est permanente et irréversible. Toutes vos données seront définitivement supprimées.
id: Peringatan: Tindakan ini bersifat permanen dan tidak dapat dibatalkan. Semua data Anda akan dihapus secara permanen.
pt: Aviso: Esta ação é permanente e não pode ser desfeita. Todos os seus dados serão excluídos permanentemente.
ru: Внимание: Это действие необратимо. Все ваши данные будут удалены навсегда.
sw: Onyo: Kitendo hiki ni cha kudumu na hakiwezi kubatilishwa. Data yako yote itafutwa kabisa.
th: คำเตือน: การกระทำนี้เป็นการถาวรและไม่สามารถย้อนกลับได้ ข้อมูลทั้งหมดของคุณจะถูกลบอย่างถาวร
zh: 警告：此操作是永久性的，无法撤销。您的所有数据将被永久删除。

source: Was this response helpful?
ar: هل كان هذا الرد مفيداً؟
de: War diese Antwort hilfreich?
es: ¿Fue útil esta respuesta?
fr: Cette réponse a-t-elle été utile ?
id: Apakah respons ini membantu?
pt: Esta resposta foi útil?
ru: Был ли этот ответ полезен?
sw: Je, jibu hili lilisaidia?
th: คำตอบนี้มีประโยชน์หรือไม่?
zh: 此回复有帮助吗？

source: Weak
ar: ضعيفة
de: Schwach
es: Débil
fr: Faible
id: Lemah
pt: Fraca
ru: Слабый
sw: Dhaifu
th: อ่อน
zh: 弱

source: Weather Forecast
ar: توقعات الطقس
de: Wettervorhersage
es: Pronóstico del tiempo
fr: Prévisions météo
id: Prakiraan Cuaca
pt: Previsão do Tempo
ru: Прогноз погоды
sw: Utabiri wa Hali ya Hewa
th: พยากรณ์อากาศ
zh: 天气预报

source: Web Development
ar: تطوير الويب
de: Webentwicklung
es: Desarrollo Web
fr: Développement Web
id: Pengembangan Web
pt: Desenvolvimento Web
ru: Веб-разработка
sw: Maendeleo ya Wavuti
th: การพัฒนาเว็บ
zh: Web开发

source: Welcome! How can I assist you with Kenya government services today?
ar: أهلاً بك! كيف يمكنني مساعدتك في الخدمات الحكومية الكينية اليوم؟
de: Willkommen! Wie kann ich dir heute bei kenianischen Regierungsdiensten helfen?
es: ¡Bienvenido! ¿Cómo puedo ayudarte con los servicios gubernamentales de Kenia hoy?
fr: Bienvenue ! Comment puis-je vous aider avec les services gouvernementaux du Kenya aujourd'hui ?
id: Selamat datang! Bagaimana saya dapat membantu Anda dengan layanan pemerintah Kenya hari ini?
pt: Bem-vindo! Como posso ajudá-lo com os serviços do governo do Quênia hoje?
ru: Добро пожаловать! Как я могу помочь вам с государственными услугами Кении сегодня?
sw: Karibu! Ninawezaje kukusaidia na huduma za serikali ya Kenya leo?
th: ยินดีต้อนรับ! ฉันจะช่วยคุณเกี่ยวกับบริการของรัฐบาลเคนยาได้อย่างไรในวันนี้?
zh: 欢迎！今天我能为您提供哪些关于肯尼亚政府服务的帮助？

source: What made you decide to delete your account?
ar: ما الذي دفعك لقرار حذف حسابك؟
de: Warum hast du dich entschieden, dein Konto zu löschen?
es: ¿Qué te hizo decidir eliminar tu cuenta?
fr: Qu'est-ce qui vous a décidé à supprimer votre compte ?
id: Apa yang membuat Anda memutuskan untuk menghapus akun Anda?
pt: O que fez você decidir excluir sua conta?
ru: Что заставило вас удалить аккаунт?
sw: Ni nini kilichokufanya uamue kufuta akaunti yako?
th: อะไรทำให้คุณตัดสินใจลบบัญชีของคุณ?
zh: 是什么让您决定删除账户？

source: Widowed
ar: أرمل/أرملة
de: Verwitwet
es: Viudo/a
fr: Veuf/Veuve
id: Janda/Duda
pt: Viúvo(a)
ru: Вдовец/Вдова
sw: Mjane
th: หม้าย
zh: 丧偶

source: Wildlife Biology
ar: بيولوجيا الحياة البرية
de: Wildbiologie
es: Biología de la Vida Silvestre
fr: Biologie de la faune
id: Biologi Satwa Liar
pt: Biologia da Vida Selvagem
ru: Биология дикой природы
sw: Biolojia ya Wanyamapori
th: ชีววิทยาสัตว์ป่า
zh: 野生动物生物学

source: will
ar: سوف
de: wird
es: se
fr: va
id: akan
pt: irá
ru: будет
sw: ita
th: จะ
zh: 将

source: with context
ar: مع السياق
de: mit Kontext
es: con contexto
fr: avec contexte
id: dengan konteks
pt: com contexto
ru: с контекстом
sw: na muktadha
th: พร้อมบริบท
zh: 附带上下文

source: Work permits and labor contracts
ar: تصاريح العمل وعقود العمل
de: Arbeitserlaubnisse und Arbeitsverträge
es: Permisos de trabajo y contratos
fr: Permis de travail et contrats de travail
id: Izin kerja dan kontrak kerja
pt: Permissões de trabalho e contratos
ru: Разрешения на работу и трудовые договоры
sw: Vibali vya kazi na mikataba ya kazi
th: ใบอนุญาตทำงานและสัญญาจ้างงาน
zh: 工作许可和劳动合同

source: Yes
ar: نعم
de: Ja
es: Sí
fr: Oui
id: Ya
pt: Sim
ru: Да
sw: Ndiyo
th: ใช่
zh: 是

source: You have unsaved changes
ar: لديك تغييرات غير محفوظة
de: Du hast ungespeicherte Änderungen
es: Tienes cambios sin guardar
fr: Vous avez des modifications non enregistrées
id: Anda memiliki perubahan yang belum disimpan
pt: Você tem alterações não salvas
ru: У вас есть несохраненные изменения
sw: Una mabadiliko ambayo hayajahifadhiwa
th: คุณมีการเปลี่ยนแปลงที่ยังไม่ได้บันทึก
zh: 您有未保存的更改

source: You have unsaved changes. Are you sure you want to cancel?
ar: لديك تغييرات غير محفوظة. هل أنت متأكد أنك تريد الإلغاء؟
de: Du hast ungespeicherte Änderungen. Bist du sicher, dass du abbrechen möchtest?
es: Tienes cambios sin guardar. ¿Seguro que deseas cancelar?
fr: Vous avez des modifications non enregistrées. Êtes-vous sûr de vouloir annuler ?
id: Anda memiliki perubahan yang belum disimpan. Apakah Anda yakin ingin membatalkan?
pt: Você tem alterações não salvas. Tem certeza de que deseja cancelar?
ru: У вас есть несохраненные изменения. Вы уверены, что хотите отменить?
sw: Una mabadiliko ambayo hayajahifadhiwa. Una uhakika unataka kughairi?
th: คุณมีการเปลี่ยนแปลงที่ยังไม่ได้บันทึก คุณแน่ใจหรือไม่ว่าต้องการยกเลิก?
zh: 您有未保存的更改。您确定要取消吗？

source: You have unsaved changes. Are you sure you want to start a new chat?
ar: لديك تغييرات غير محفوظة. هل أنت متأكد أنك تريد بدء محادثة جديدة؟
de: Du hast ungespeicherte Änderungen. Bist du sicher, dass du einen neuen Chat beginnen möchtest?
es: Tienes cambios sin guardar. ¿Estás seguro de que quieres iniciar un nuevo chat?
fr: Vous avez des modifications non enregistrées. Êtes-vous sûr de vouloir commencer un nouveau chat ?
id: Anda memiliki perubahan yang belum disimpan. Apakah Anda yakin ingin memulai obrolan baru?
pt: Você tem alterações não salvas. Tem certeza de que deseja iniciar um novo chat?
ru: У вас есть несохраненные изменения. Вы уверены, что хотите начать новый чат?
sw: Una mabadiliko ambayo hayajahifadhiwa. Una uhakika unataka kuanza gumzo mpya?
th: คุณมีการเปลี่ยนแปลงที่ยังไม่ได้บันทึก คุณแน่ใจหรือไม่ว่าต้องการเริ่มแชทใหม่?
zh: 您有未保存的更改。您确定要开始新聊天吗？

source: You have unsaved changes. Do you want to discard them and load the selected conversation, or save the current conversation first?
ar: لديك تغييرات غير محفوظة. هل تريد تجاهلها وتحميل المحادثة المحددة، أم حفظ المحادثة الحالية أولاً؟
de: Du hast ungespeicherte Änderungen. Möchtest du sie verwerfen und die ausgewählte Unterhaltung laden oder die aktuelle Unterhaltung zuerst speichern?
es: Tienes cambios sin guardar. ¿Quieres descartarlos y cargar la conversación seleccionada, o guardar la actual primero?
fr: Vous avez des modifications non enregistrées. Voulez-vous les ignorer et charger la conversation sélectionnée, ou enregistrer la conversation actuelle d'abord ?
id: Anda memiliki perubahan yang belum disimpan. Apakah Anda ingin membuangnya dan memuat percakapan yang dipilih, atau menyimpan percakapan saat ini terlebih dahulu?
pt: Você tem alterações não salvas. Deseja descartá-las e carregar a conversa selecionada ou salvar a conversa atual primeiro?
ru: У вас есть несохраненные изменения. Хотите отменить их и загрузить выбранный разговор, или сначала сохранить текущий?
sw: Una mabadiliko ambayo hayajahifadhiwa. Je, unataka kuyatupa na kupakia mazungumzo yaliyochaguliwa, au kuhifadhi mazungumzo ya sasa kwanza?
th: คุณมีการเปลี่ยนแปลงที่ยังไม่ได้บันทึก คุณต้องการทิ้งการเปลี่ยนแปลงแล้วโหลดบทสนทนาที่เลือก หรือบันทึกบทสนทนาปัจจุบันก่อน?
zh: 您有未保存的更改。您想放弃它们并加载所选对话，还是先保存当前对话？

source: You have unsaved changes. Load anyway?
ar: لديك تغييرات غير محفوظة. هل تريد التحميل على أي حال؟
de: Sie haben ungespeicherte Änderungen. Trotzdem laden?
es: Tienes cambios sin guardar. ¿Cargar de todos modos?
fr: Vous avez des modifications non enregistrées. Charger quand même ?
id: Anda memiliki perubahan yang belum disimpan. Tetap muat?
pt: Você tem alterações não salvas. Carregar de qualquer maneira?
ru: У вас есть несохраненные изменения. Все равно загрузить?
sw: Una mabadiliko ambayo hayajahifadhiwa. Pakia hata hivyo?
th: คุณมีการเปลี่ยนแปลงที่ยังไม่ได้บันทึก โหลดเลยหรือไม่?
zh: 您有未保存的更改。无论如何都要加载吗？

source: You have unsaved changes. Start new chat anyway?
ar: لديك تغييرات غير محفوظة. هل تريد بدء محادثة جديدة على أي حال؟
de: Sie haben ungespeicherte Änderungen. Trotzdem neuen Chat starten?
es: Tienes cambios sin guardar. ¿Iniciar nuevo chat de todos modos?
fr: Vous avez des modifications non enregistrées. Commencer un nouveau chat quand même ?
id: Anda memiliki perubahan yang belum disimpan. Tetap mulai obrolan baru?
pt: Você tem alterações não salvas. Iniciar novo chat de qualquer maneira?
ru: У вас есть несохраненные изменения. Все равно начать новый чат?
sw: Una mabadiliko ambayo hayajahifadhiwa. Anza gumzo mpya hata hivyo?
th: คุณมีการเปลี่ยนแปลงที่ยังไม่ได้บันทึก เริ่มแชทใหม่เลยหรือไม่?
zh: 您有未保存的更改。无论如何都要开始新聊天吗？

source: You must accept the Terms of Service
ar: يجب الموافقة على شروط الخدمة
de: Du musst die Nutzungsbedingungen akzeptieren
es: Debes aceptar los Términos de servicio
fr: Vous devez accepter les conditions d'utilisation
id: Anda harus menerima Ketentuan Layanan
pt: Você deve aceitar os Termos de Serviço
ru: Вы должны принять Условия использования
sw: Lazima ukubali Masharti ya Huduma
th: คุณต้องยอมรับเงื่อนไขการให้บริการ
zh: 您必须接受服务条款

source: You will be logged out after changing your email
ar: سيتم تسجيل خروجك بعد تغيير بريدك الإلكتروني
de: Sie werden nach der Änderung Ihrer E-Mail-Adresse abgemeldet
es: Se cerrará su sesión después de cambiar su correo electrónico
fr: Vous serez déconnecté après avoir changé votre adresse e-mail
id: Anda akan keluar setelah mengubah email
pt: Você será desconectado após alterar seu e-mail
ru: После изменения электронной почты вы будете выведены из системы
sw: Utaondolewa baada ya kubadilisha barua pepe yako
th: คุณจะถูกออกจากระบบหลังจากเปลี่ยนอีเมล
zh: 更改电子邮件后您将被注销

source: Your account has been deleted successfully.
ar: تم حذف حسابك بنجاح.
de: Dein Konto wurde erfolgreich gelöscht.
es: Tu cuenta ha sido eliminada con éxito.
fr: Votre compte a été supprimé avec succès.
id: Akun Anda telah berhasil dihapus.
pt: Sua conta foi excluída com sucesso.
ru: Ваш аккаунт был успешно удален.
sw: Akaunti yako imefutwa kikamilifu.
th: บัญชีของคุณถูกลบเรียบร้อยแล้ว
zh: 您的账户已成功删除。

source: Your account has been successfully verified. You can now log in to your account.
ar: تم التحقق من حسابك بنجاح. يمكنك الآن تسجيل الدخول إلى حسابك.
de: Dein Konto wurde erfolgreich verifiziert. Du kannst dich jetzt anmelden.
es: Tu cuenta ha sido verificada con éxito. Ahora puedes iniciar sesión.
fr: Votre compte a été vérifié avec succès. Vous pouvez maintenant vous connecter.
id: Akun Anda telah berhasil diverifikasi. Anda sekarang dapat masuk ke akun Anda.
pt: Sua conta foi verificada com sucesso. Agora você pode entrar na sua conta.
ru: Ваш аккаунт успешно подтвержден. Теперь вы можете войти в систему.
sw: Akaunti yako imethibitishwa. Sasa unaweza kuingia kwenye akaunti yako.
th: บัญชีของคุณได้รับการยืนยันเรียบร้อยแล้ว คุณสามารถเข้าสู่ระบบบัญชีของคุณได้ทันที
zh: 您的账户已成功验证。您现在可以登录您的账户。

source: Your current password
ar: كلمة المرور الحالية
de: Dein aktuelles Passwort
es: Tu contraseña actual
fr: Votre mot de passe actuel
id: Kata sandi Anda saat ini
pt: Sua senha atual
ru: Ваш текущий пароль
sw: Nenosiri lako la sasa
th: รหัสผ่านปัจจุบันของคุณ
zh: 您当前的密码

source: Your data has been reset.
ar: تم إعادة تعيين بياناتك.
de: Deine Daten wurden zurückgesetzt.
es: Tus datos han sido restablecidos.
fr: Vos données ont été réinitialisées.
id: Data Anda telah disetel ulang.
pt: Seus dados foram redefinidos.
ru: Ваши данные были сброшены.
sw: Data yako imewekwa upya.
th: ข้อมูลของคุณถูกรีเซ็ตแล้ว
zh: 您的数据已重置。

source: Your email address
ar: بريدك الإلكتروني
de: Deine E-Mail-Adresse
es: Tu correo electrónico
fr: Votre adresse e-mail
id: Alamat email Anda
pt: Seu endereço de e-mail
ru: Ваш email
sw: Barua pepe yako
th: ที่อยู่อีเมลของคุณ
zh: 您的电子邮件地址

source: Your feedback will be used to better tune the chatbot and improve responses over time.
ar: سيتم استخدام ملاحظاتك لتحسين ضبط روبوت الدردشة وتحسين الردود بمرور الوقت.
de: Dein Feedback wird verwendet, um den Chatbot besser abzustimmen und die Antworten im Laufe der Zeit zu verbessern.
es: Tus comentarios se usarán para ajustar mejor el chatbot y mejorar las respuestas con el tiempo.
fr: Vos commentaires seront utilisés pour mieux ajuster le chatbot et améliorer les réponses au fil du temps.
id: Umpan balik Anda akan digunakan untuk menyetel chatbot dengan lebih baik dan meningkatkan respons dari waktu ke waktu.
pt: Seu feedback será usado para ajustar melhor o chatbot e melhorar as respostas ao longo do tempo.
ru: Ваш отзыв будет использован для лучшей настройки чат-бота и улучшения ответов со временем.
sw: Maoni yako yatatumika kuboresha roboti ya gumzo na majibu kadri muda unavyokwenda.
th: ข้อเสนอแนะของคุณจะถูกนำไปใช้เพื่อปรับปรุงแชทบอทและการตอบกลับให้ดียิ่งขึ้นเมื่อเวลาผ่านไป
zh: 您的反馈将用于更好地调整聊天机器人并随着时间的推移改进回复。

source: Your password has been successfully reset
ar: تم إعادة تعيين كلمة المرور بنجاح
de: Dein Passwort wurde erfolgreich zurückgesetzt
es: Tu contraseña se ha restablecido con éxito
fr: Votre mot de passe a été réinitialisé avec succès
id: Kata sandi Anda telah berhasil disetel ulang
pt: Sua senha foi redefinida com sucesso
ru: Ваш пароль был успешно сброшен
sw: Nenosiri lako limewekwa upya
th: รหัสผ่านของคุณถูกรีเซ็ตเรียบร้อยแล้ว
zh: 您的密码已成功重置

source: Your profile data has been successfully reset.
ar: تم إعادة تعيين بيانات ملفك الشخصي بنجاح.
de: Deine Profildaten wurden erfolgreich zurückgesetzt.
es: Tus datos de perfil han sido restablecidos.
fr: Vos données de profil ont été réinitialisées avec succès.
id: Data profil Anda telah berhasil disetel ulang.
pt: Seus dados de perfil foram redefinidos com sucesso.
ru: Данные вашего профиля успешно сброшены.
sw: Data ya wasifu wako imewekwa upya kikamilifu.
th: ข้อมูลโปรไฟล์ของคุณถูกรีเซ็ตเรียบร้อยแล้ว
zh: 您的个人资料数据已成功重置。

source: Your profile has been updated
ar: تم تحديث ملفك الشخصي
de: Dein Profil wurde aktualisiert
es: Tu perfil ha sido actualizado
fr: Votre profil a été mis à jour
id: Profil Anda telah diperbarui
pt: Seu perfil foi atualizado
ru: Ваш профиль был обновлен
sw: Wasifu wako umesasishwa
th: โปรไฟล์ของคุณได้รับการอัปเดตแล้ว
zh: 您的个人资料已更新

source: Your profile is incomplete
ar: ملفك الشخصي غير مكتمل
de: Dein Profil ist unvollständig
es: Tu perfil está incompleto
fr: Votre profil est incomplet
id: Profil Anda tidak lengkap
pt: Seu perfil está incompleto
ru: Ваш профиль не заполнен
sw: Wasifu wako haujakamilika
th: โปรไฟล์ของคุณไม่สมบูรณ์
zh: 您的个人资料不完整

source: Your session has expired, please log in again
ar: انتهت صلاحية الجلسة، يرجى تسجيل الدخول مرة أخرى
de: Deine Sitzung ist abgelaufen, bitte melde dich erneut an
es: Tu sesión ha expirado, inicia sesión de nuevo
fr: Votre session a expiré, veuillez vous reconnecter
id: Sesi Anda telah berakhir, silakan masuk lagi
pt: Sua sessão expirou, por favor entre novamente
ru: Ваша сессия истекла, пожалуйста, войдите снова
sw: Kipindi chako kimeisha, tafadhali ingia tena
th: เซสชันของคุณหมดอายุ โปรดเข้าสู่ระบบอีกครั้ง
zh: 您的会话已过期，请重新登录

source: Zoology
ar: علم الحيوان
de: Zoologie
es: Zoología
fr: Zoologie
id: Zoologi
pt: Zoologia
ru: Зоология
sw: Zoolojia
th: สัตววิทยา
zh: 动物学
